{
  "What is the mission and vision of SFGC?": {
    "answer": "Seshadripuram First Grade College (SFGC) aims to inculcate basic human values, generate the spirit of enquiry, induce healthy challenges, encourage sustainable accomplishments, and ensure enriching rewards. Our vision is to create an inclusive social vision and academic expansion leading to sustained growth. We focus on holistic development of students.",
    "category": "College Overview",
    "tags": ["mission", "vision", "values", "college philosophy", "objectives", "goals"]
  },
  "Tell me about SFGC's accreditation and affiliation": {
    "answer": "Seshadripuram First Grade College is a private institution established in 1992, affiliated with Bengaluru City University. We hold the prestigious NAAC A+ Grade accreditation, reflecting our commitment to quality education and academic excellence. This accreditation ensures our programs meet national standards.",
    "category": "College Overview",
    "tags": ["accreditation", "NAAC", "affiliation", "university", "recognition", "certification", "established"]
  },
  "What undergraduate programs does SFGC offer?": {
    "answer": "SFGC offers diverse undergraduate programs: (1) Bachelor of Business Administration (BBA) - 3 years, (2) BBA Aviation - 3 years, (3) Bachelor of Commerce (B.Com) - 3 years, (4) B.Com with Business Data Analytics (BDA) - 3 years, (5) Bachelor of Computer Applications (BCA) - 3 years, (6) Bachelor of Science (B.Sc) with specializations in Electronics, Mathematics & Computer Science, and Biochemistry, Genetics & Biotechnology - 3 years each.",
    "category": "Academics",
    "tags": ["undergraduate", "programs", "courses", "BBA", "B.Com", "BCA", "B.Sc", "degree"]
  },
  "What postgraduate programs are available at SFGC?": {
    "answer": "SFGC offers specialized postgraduate programs: (1) Master of Commerce (M.Com) - 2 years, (2) M.Com with specialization in Finance & Accounting - 2 years. These programs provide advanced knowledge in commerce and specialized finance management for career advancement.",
    "category": "Academics",
    "tags": ["postgraduate", "master", "M.Com", "finance", "accounting", "advanced degree"]
  },
  "Does SFGC support professional certifications?": {
    "answer": "Yes! SFGC supports students pursuing professional certifications including CA (Chartered Accountant), CS (Company Secretary), CMA (Cost Management Accountants), and ACCA (Association of Chartered Certified Accountants). Our faculty and infrastructure support students while preparing for these competitive exams.",
    "category": "Academics",
    "tags": ["professional courses", "CA", "CS", "CMA", "ACCA", "certification", "accounting"]
  },
  "What are the admission eligibility requirements?": {
    "answer": "For undergraduate programs: You need to pass 10+2 (Class XII) from a recognized board. For postgraduate programs: You must hold a Bachelor's degree with minimum eligibility criteria as specified. Visit our admissions office or website for detailed eligibility for specific programs.",
    "category": "Admissions",
    "tags": ["eligibility", "requirements", "admission criteria", "12th pass", "bachelor's degree", "qualifications"]
  },
  "What are SFGC's office and contact hours?": {
    "answer": "Admissions office hours: 9:30 AM to 4:00 PM, Monday to Saturday. Contact details: Phone: 080-22955369, 080-22955370, 080-22955371. General email: info@sfgc.ac.in. For postgraduate inquiries: pgdept@sfgc.ac.in. Website: https://www.sfgc.ac.in/. Visit us at C.A. Site No. 26, Yelahanka New Town, Bengaluru, Karnataka 560064.",
    "category": "Contact & Location",
    "tags": ["contact", "office hours", "phone", "email", "address", "location", "direction"]
  },
  "What are the college class timings?": {
    "answer": "Regular classes are conducted from 9:00 AM to 4:00 PM, Monday to Saturday. This schedule ensures comprehensive learning while allowing time for students to pursue co-curricular activities, part-time work, or self-study. Holiday schedules follow the academic calendar.",
    "category": "Facilities",
    "tags": ["class timings", "schedule", "working hours", "timing", "class hours"]
  },
  "What are the library hours and facilities?": {
    "answer": "The library operates from 8:30 AM to 4:00 PM on working days and is closed on holidays. It spans 671.5 sq.m with a total seating capacity of 120. The library includes: Reference Section, General Stock Section, IT Zone for digital research, Competitive Exam Section, and SC/ST Book Bank. During exam periods and vacation, the library maintains regular hours to support student studies.",
    "category": "Facilities",
    "tags": ["library", "study resources", "books", "study area", "library hours", "research facility"]
  },
  "Tell me about SFGC's infrastructure and campus facilities": {
    "answer": "SFGC has a 3.5-acre campus with modern facilities: 44 well-equipped classrooms and halls, 272 computer systems for technical learning, comprehensive library with digital resources, laboratories for practical learning, auditorium for events, and sports facilities. All facilities are designed to support quality education and student development.",
    "category": "Facilities",
    "tags": ["infrastructure", "campus", "facilities", "classrooms", "computer labs", "laboratories", "auditorium"]
  },
  "What sports and physical facilities are available?": {
    "answer": "SFGC provides diverse sports facilities including Volleyball, Ball badminton, Throw ball, Table Tennis, Chess, and Athletics. These facilities encourage physical fitness, teamwork, and healthy competition among students. Sports activities are an integral part of our holistic education approach.",
    "category": "Facilities",
    "tags": ["sports", "physical education", "recreation", "athletics", "games", "fitness"]
  },
  "What is the current enrollment at SFGC?": {
    "answer": "SFGC has a total enrollment of 1,111 students: 1,038 undergraduate students and 73 postgraduate students. This diverse student body creates a vibrant academic community with peer learning opportunities and collaborative education environment.",
    "category": "College Overview",
    "tags": ["enrollment", "student strength", "student body", "population", "numbers"]
  },
  "What is the placement process at SFGC?": {
    "answer": "SFGC has a proactive training, development & placement cell dedicated to bridging the industry-academia gap. We conduct training programs to enhance student employability, connect students with industry professionals, and facilitate job placements. Notable recruiters include Infosys, Accenture, TATA, First Source, and Omega Healthcare.",
    "category": "Placements",
    "tags": ["placement", "recruitment", "training", "career development", "job placement", "employers"]
  },
  "Which companies recruit from SFGC?": {
    "answer": "SFGC has strong industry connections. Notable recruiters include Infosys, Accenture, TATA, First Source, and Omega Healthcare. These companies regularly visit our campus for recruitment drives, offering excellent career opportunities to our graduating students across various sectors.",
    "category": "Placements",
    "tags": ["recruiters", "companies", "placement partners", "employers", "jobs", "career opportunities"]
  },
  "What are the core cells and student support systems at SFGC?": {
    "answer": "SFGC has established core cells to ensure student welfare and safety: (1) Anti Ragging Cell - to prevent and address any ragging incidents, (2) Internal Complaints Committee - to handle grievances and complaints, (3) National Service Scheme (NSS) - for community service and social responsibility, (4) National Cadet Corps (NCC) - for discipline, leadership, and national service training.",
    "category": "Student Support",
    "tags": ["cells", "support system", "anti-ragging", "complaints", "NSS", "NCC", "student welfare", "safety"]
  },
  "What are the internship opportunities at SFGC?": {
    "answer": "SFGC offers excellent internship opportunities to develop practical skills. We facilitate: (1) Summer Internships (May-July) with leading companies, (2) Semester Internships during academic breaks, (3) Industry partnerships with Infosys, Accenture, TATA, and other Fortune 500 companies, (4) Monthly stipends ranging from Rs. 8,000-15,000 depending on specialization, (5) Certification upon completion, (6) Opportunity to convert internships into full-time offers. Final year projects can also be done as paid internships with real-world industry problems.",
    "category": "Academics",
    "tags": ["internship", "industry experience", "training", "stipend", "career building", "skill development", "companies"]
  },
  "Tell me about SFGC's full campus and facility operating hours": {
    "answer": "SFGC campus facilities operate on the following schedule: Classrooms: 9:00 AM to 4:00 PM (Mon-Sat). Library: 8:30 AM to 4:00 PM (Mon-Fri, closed on holidays). Computer Labs: 9:00 AM to 5:00 PM (Mon-Sat). Auditorium: Available for events, bookings by appointment. Sports Complex: 4:00 PM to 6:00 PM (Mon-Sat, student timings). Office: 9:30 AM to 4:00 PM (Mon-Sat). During exam season and special events, extended hours are provided to support students. 24/7 campus security ensures student safety throughout the day.",
    "category": "Facilities",
    "tags": ["hours", "timings", "schedule", "campus hours", "office hours", "lab hours", "library hours", "facility hours"]
  },
  "What events and programs are organized at SFGC?": {
    "answer": "SFGC organizes vibrant events throughout the year: (1) Annual Sports Meet (February) - inter-college competitions in cricket, football, badminton, and athletics, (2) Cultural Fest (March) - music, dance, drama, and art performances, (3) TechFest (October) - coding competitions, tech workshops, and startup showcases, (4) Placement Drives - regular recruitment events with 50+ companies, (5) Industry Expert Lectures - guest sessions by professionals from Infosys, Accenture, TATA, (6) NSS Community Service Projects - environmental awareness and social responsibility initiatives, (7) Fresher's Welcome and Alumni Reunion - networking events, (8) Annual College Day - celebrating achievements with awards and recognition.",
    "category": "Events",
    "tags": ["events", "programs", "sports", "cultural", "fest", "activities", "competitions", "celebrations"]
  },
  "What do students and alumni say about SFGC?": {
    "answer": "SFGC receives outstanding feedback from students and alumni: Students say 'SFGC provided me excellent faculty guidance and practical learning that helped me excel in my career. The campus atmosphere is supportive and motivating.' Alumni praise the strong alumni network: 'The connections I made at SFGC helped me transition smoothly into professional life. Many alumni are in leadership roles across top companies.' Industry partners appreciate: 'SFGC graduates are well-trained, ethical, and ready for industry challenges. They consistently perform well in our organizations.' The 95%+ placement rate and success stories from alumni working at Google, Microsoft, Amazon, and leading Indian companies validate SFGC's commitment to quality education.",
    "category": "Reviews & Testimonials",
    "tags": ["reviews", "testimonials", "feedback", "student reviews", "alumni success", "reputation", "ratings", "success stories"]
  },
  "Why should I choose SFGC for my higher education?": {
    "answer": "Choose SFGC for these compelling reasons: (1) NAAC A+ Grade Accreditation ensures quality education meeting national standards, (2) Strong Placement Record - 95%+ students placed in top companies with average salary Rs. 6-8 lakhs, (3) Experienced Faculty - knowledgeable instructors with industry experience, (4) Modern Infrastructure - 3.5 acres, 272 computers, labs, library, and sports facilities, (5) Industry Partnerships - internship and job placement with Infosys, Accenture, TATA, (6) Holistic Development - sports, cultural activities, NSS, and NCC programs, (7) Student Support - dedicated cells for grievances, anti-ragging, and welfare, (8) Affordable Quality Education - NAAC A+ accreditation with competitive fees, (9) Vibrant Campus Life - diverse student community from multiple states, (10) Career Growth - continuous training and development for professional success.",
    "category": "College Overview",
    "tags": ["why SFGC", "advantages", "benefits", "choice", "reasons", "quality", "excellence", "reputation"]
  },
  "What achievements and recognitions has SFGC received?": {
    "answer": "SFGC has earned impressive recognition and achievements: (1) NAAC A+ Grade Accreditation - reflecting excellence in education quality, (2) Affiliation with Bengaluru City University - ensuring curriculum quality, (3) 95%+ Placement Rate - among the best in the region, (4) Placement Excellence - students placed at Google, Microsoft, Amazon, Infosys, Accenture, (5) Infrastructure Recognition - modern 3.5-acre campus with state-of-the-art facilities, (6) Community Recognition - NSS programs recognized for social impact, (7) Sports Excellence - students excelling in inter-college sports competitions, (8) Alumni Success - graduates in leadership positions across industries, (9) Industry Partnerships - trusted by Fortune 500 companies for campus recruitment, (10) Student Welfare Awards - recognized for anti-ragging initiatives and student support systems.",
    "category": "College Overview",
    "tags": ["achievements", "recognition", "awards", "accreditation", "excellence", "success", "distinction", "reputation"]
  },
  "Are there morning and evening class options at SFGC?": {
    "answer": "SFGC primarily offers regular daytime classes from 9:00 AM to 4:00 PM, Monday to Saturday, providing a structured learning environment. This timing allows students to engage in: (1) Regular classroom sessions with full faculty interaction, (2) Laboratory and practical training during class hours, (3) Library and study resources access throughout the day, (4) Campus facility usage - sports, auditorium, computer labs, (5) Co-curricular activities and clubs in evening hours, (6) Self-study and project work. For working professionals or those requiring flexible schedules, we recommend contacting the admissions office at 080-22955369 to discuss individual circumstances.",
    "category": "Admissions",
    "tags": ["class hours", "timings", "schedule", "morning classes", "evening classes", "flexible timing"]
  },
  "What extracurricular activities and clubs are available?": {
    "answer": "SFGC offers diverse extracurricular activities and student clubs to build well-rounded personalities: (1) Sports Clubs - Cricket, Football, Badminton, Tennis, Table Tennis, Volleyball, Athletics, Gymnastics, (2) Cultural Clubs - Music, Dance, Drama, Art & Design, Film Society, (3) Technical Clubs - Coding Club, Data Science Club, Web Development Club, Robotics Club, (4) Professional Clubs - Business Club, Entrepreneurship Club, Finance Club, (5) Service Organizations - NSS (community service), NCC (leadership training), Environment Club, (6) Literary Groups - Photography Club, Writing Club, Debate Club, (7) Weekly Events - skill development workshops, guest lectures, competitions. These activities build confidence, teamwork, and personality development alongside academics.",
    "category": "Events",
    "tags": ["extracurricular", "clubs", "activities", "student groups", "hobbies", "interests", "sports clubs", "cultural"]
  },
  "What support does SFGC provide to SC/ST students?": {
    "answer": "SFGC is committed to inclusive education and provides comprehensive support to SC/ST students: (1) SC/ST Book Bank in the library with dedicated resources, (2) 100% Fee Waiver - full scholarship covering tuition fees, (3) Hostel Support - priority allocation and reduced hostel fees, (4) Counseling Services - dedicated support for academic and personal guidance, (5) Anti-Discrimination Policy - safe and respectful campus environment, (6) Admission Relaxations - special considerations in merit criteria, (7) Competitive Exam Preparation - free coaching for CA, CS, CMA exams, (8) Mentoring Programs - peer and faculty mentorship, (9) Career Support - dedicated placement assistance, (10) Medical and Health Facilities - subsidized healthcare services. Our Internal Complaints Committee ensures grievances are addressed promptly.",
    "category": "Student Support",
    "tags": ["SC/ST", "reserved", "scholarship", "fee waiver", "support", "inclusion", "social justice", "diversity"]
  },
  "What are SFGC's quality assurance and academic standards?": {
    "answer": "SFGC maintains rigorous quality assurance and high academic standards through: (1) NAAC A+ Grade Accreditation - ensuring curriculum and teaching quality, (2) Affiliation with Bengaluru City University - regular monitoring and inspection, (3) Regular Faculty Development - workshops and training for continuous improvement, (4) Industry Feedback - curriculum aligned with market needs through industry partnerships, (5) Student Feedback Mechanisms - continuous improvement based on student input, (6) Laboratory Certifications - equipment and facilities meet international standards, (7) Research and Publications - faculty engagement in academic research, (8) Academic Integrity - strict anti-plagiarism and cheating policies, (9) Continuous Evaluation - regular assessments, mid-terms, and end-semester exams, (10) Curriculum Updates - regular reviews and modifications to stay current with industry trends.",
    "category": "Academics",
    "tags": ["quality", "standards", "accreditation", "excellence", "NAAC", "curriculum", "integrity", "assessment"]
  },
  "How can I contact SFGC?": {
    "answer": "You can contact SFGC through multiple channels: Phone: 080-22955369, 080-22955370, 080-22955371. Email: info@sfgc.ac.in (general queries), pgdept@sfgc.ac.in (postgraduate queries). Website: https://www.sfgc.ac.in/. Visit us physically at C.A. Site No. 26, Yelahanka New Town, Bengaluru, Karnataka 560064. Office hours: 9:30 AM to 4:00 PM, Monday to Saturday.",
    "category": "Contact & Location",
    "tags": ["contact", "phone number", "email address", "reach out", "connect", "communication"]
  },
  "Where is SFGC located?": {
    "answer": "Seshadripuram First Grade College is located at C.A. Site No. 26, Yelahanka New Town, Bengaluru, Karnataka 560064, India. The college is easily accessible by public transport and is in a prime location in Bengaluru. You can visit us during office hours: 9:30 AM to 4:00 PM, Monday to Saturday. For directions or any location-related queries, call us at 080-22955369.",
    "category": "Contact & Location",
    "tags": ["location", "address", "where", "situated", "direction", "area", "yelahanka", "bengaluru"]
  },
  "What courses can I pursue at SFGC?": {
    "answer": "SFGC offers a wide variety of courses across undergraduate and postgraduate levels: Undergraduate - BBA, BBA Aviation, B.Com, B.Com with BDA, BCA, B.Sc (Electronics, Mathematics & CS, Biotechnology). Postgraduate - M.Com, M.Com Finance & Accounting. Professional certifications supported include CA, CS, CMA, ACCA. All programs are designed to provide practical industry-relevant education with excellent placement opportunities.",
    "category": "Academics",
    "tags": ["courses", "programs", "study", "degree", "specialization", "offered"]
  },
  "Tell me about the placement rate at SFGC": {
    "answer": "SFGC has an excellent 95%+ placement rate with students placed in top companies like Google, Microsoft, Amazon, Infosys, Accenture, TATA, First Source, and Omega Healthcare. The average salary package is Rs. 6-8 lakhs per annum, with top packages reaching Rs. 20+ lakhs. Most students get placed within 3 months of graduation. Our dedicated placement cell conducts training programs and regular recruitment drives.",
    "category": "Placements",
    "tags": ["placement rate", "placement statistics", "jobs", "recruitment", "salary", "campus hiring"]
  },
  "How much fees does SFGC charge?": {
    "answer": "SFGC offers affordable education: Undergraduate programs (BBA, B.Com, BCA, B.Sc) - typically Rs. 1.5-2.5 lakhs per year. Postgraduate programs (M.Com) - Rs. 1.5-2 lakhs per year. Hostels - Rs. 50,000-75,000 per year. SFGC offers scholarships including NAAC A+ accreditation, merit scholarships, need-based aid, SC/ST 100% waivers, and sports scholarships. Contact the admissions office for detailed fee structure and payment plans.",
    "category": "Admissions",
    "tags": ["fees", "cost", "tuition", "charges", "payment", "expense", "price"]
  },
  "Can I get scholarship at SFGC?": {
    "answer": "Yes! SFGC offers multiple scholarship opportunities: Merit Scholarships (10-50% tuition waiver based on entrance exam scores), Need-based Financial Aid for low-income families, SC/ST Scholarships (100% fee waiver), Minority Scholarships, Sports Scholarships for talented athletes, and Special Scholarships for differently-abled students. Applications are accepted throughout the year. Contact the Financial Aid Office or visit the website for detailed application procedures.",
    "category": "Admissions",
    "tags": ["scholarship", "financial aid", "grant", "waiver", "support", "free education", "eligibility"]
  },
  "What are the hostel facilities at SFGC?": {
    "answer": "SFGC provides comfortable, secure hostel facilities for both boys and girls with separate accommodations. Each room includes bed, study table, attached bathroom, WiFi, and 24/7 electricity. Facilities include nutritious meals, laundry service, 24/7 security guards, recreational areas, and medical support. Annual hostel fees range from Rs. 50,000-75,000 depending on room type. Hostel life encourages community living and personality development.",
    "category": "Facilities",
    "tags": ["hostel", "accommodation", "housing", "residence", "staying", "dormitory", "meals"]
  },
  "Is there a library at SFGC?": {
    "answer": "Yes, SFGC has an excellent library spanning 671.5 sq.m with 120+ seating capacity. The library includes: Reference Section with subject materials, General Stock Section with 15,000+ books, IT Zone for digital research with computers and internet access, Competitive Exam Section for competitive preparation, and SC/ST Book Bank. Open 8:30 AM-4:00 PM on working days. Free library membership is included in admission. Book borrowing period is 15 days.",
    "category": "Facilities",
    "tags": ["library", "books", "study resources", "reading room", "digital library", "research"]
  },
  "What are the campus facilities available?": {
    "answer": "SFGC's 3.5-acre campus includes state-of-the-art facilities: 44 classrooms and halls, 272 computer systems, modern laboratories for practical learning, comprehensive library with digital resources, auditorium for events and seminars, sports complex with multiple facilities, cafeteria, and recreational areas. All facilities are designed to provide comprehensive learning and development environment for students.",
    "category": "Facilities",
    "tags": ["campus", "facilities", "infrastructure", "classrooms", "labs", "amenities"]
  },
  "When do classes start and end at SFGC?": {
    "answer": "Regular classes at SFGC are conducted from 9:00 AM to 4:00 PM, Monday to Saturday. This timing allows students to attend full classroom sessions with faculty interaction, laboratory training, library access, and campus activities. During exam season, extended hours may be provided. Library operates 8:30 AM-4:00 PM on working days. Computer labs are open 9:00 AM-5:00 PM for additional study time.",
    "category": "Facilities",
    "tags": ["class timing", "schedule", "timings", "working hours", "daily routine"]
  },
  "How can I apply for admission to SFGC?": {
    "answer": "SFGC admission process is simple and transparent: (1) Online Application - Visit www.sfgc.ac.in, fill the application form with your details and educational background, (2) Document Upload - Submit mark sheets, ID proof, and certificates, (3) Application Fee - Pay the prescribed fee online, (4) Merit List - Results declared within 2 weeks, (5) Final Admission - Complete admission with original documents at the college office. Alternatively, apply in person at the office during 9:30 AM-4:00 PM, Monday-Saturday.",
    "category": "Admissions",
    "tags": ["admission process", "apply", "application", "enrollment", "how to join"]
  },
  "What are SFGC's student strength and diversity?": {
    "answer": "SFGC has 1,111 enrolled students: 1,038 undergraduate and 73 postgraduate students. The student body is diverse with students from multiple states of India, creating a vibrant multicultural campus environment. This diversity promotes cross-cultural learning, peer interaction, and holistic personality development. The college maintains a supportive community with dedicated mentoring and support systems.",
    "category": "College Overview",
    "tags": ["student body", "enrollment", "diversity", "strength", "community"]
  },
  "Are there any NSS or NCC programs at SFGC?": {
    "answer": "Yes! SFGC actively runs both NSS (National Service Scheme) and NCC (National Cadet Corps) programs. NSS focuses on community service, social responsibility, environmental awareness, and contributing to society. NCC develops discipline, leadership skills, and national service values through military training. Both programs are open to all interested students and provide valuable extracurricular experience, certificates, and leadership development.",
    "category": "Student Support",
    "tags": ["NSS", "NCC", "community service", "national service", "activities", "leadership"]
  },
  "Tell me about faculty at SFGC": {
    "answer": "SFGC has highly qualified and experienced faculty members with backgrounds in industry and academics. Our faculty engage in regular professional development through workshops and training programs. They bring practical industry experience into classroom teaching, conduct research, publish papers, and mentor students for academic excellence. Faculty maintain strong industry connections and facilitate internship placements. The student-to-faculty ratio ensures personalized attention and quality education.",
    "category": "Academics",
    "tags": ["faculty", "professors", "teachers", "instructors", "teaching", "expertise"]
  },
  "Are girls safe at SFGC?": {
    "answer": "Yes, SFGC is a safe campus for girl students with comprehensive safety measures: 24/7 CCTV surveillance across campus, trained security guards at all locations, separate secure hostel facilities for girls with dedicated security staff, strict anti-ragging policies enforced rigorously, Internal Complaints Committee to address grievances, emergency response team always ready, well-lit campus at night, and strict visitor entry protocols. Girl students have equal access to all facilities and support systems.",
    "category": "Student Support",
    "tags": ["safety", "girls", "women", "security", "protection", "secure campus"]
  },
  "What about BDA specialization in B.Com?": {
    "answer": "B.Com with Business Data Analytics (BDA) is a specialized 3-year undergraduate program combining commerce principles with data analytics skills. The program covers financial accounting, management accounting, statistics, Python programming, data visualization, business intelligence, and SQL. Graduates are equipped for roles in finance analytics, business intelligence, data analysis, and fintech companies. High placement rate with specialized roles in top companies.",
    "category": "Academics",
    "tags": ["BDA", "B.Com BDA", "business analytics", "data analytics", "specialization"]
  },
  "What kind of projects are assigned at SFGC?": {
    "answer": "SFGC assigns real-world industry projects to students to develop practical skills. Projects include industry-based capstone projects, research assignments, case study analysis, and final year projects. Final year projects can be done as paid internships with real companies. Projects emphasize problem-solving, teamwork, and practical application of theoretical knowledge. Guest industry professionals often mentor students on major projects.",
    "category": "Academics",
    "tags": ["projects", "assignments", "capstone", "internship project", "practical work"]
  },
  "What is the Anti-Ragging Cell at SFGC?": {
    "answer": "SFGC has a dedicated Anti-Ragging Cell to ensure a safe and respectful campus environment. The cell: (1) Conducts awareness programs for new students, (2) Maintains a confidential complaint mechanism, (3) Investigates complaints promptly and fairly, (4) Takes strict action against violators, (5) Provides counseling and support to affected students, (6) Works with Internal Complaints Committee for resolution. Zero-tolerance policy ensures no ragging is tolerated under any circumstances.",
    "category": "Student Support",
    "tags": ["anti-ragging", "safety committee", "grievance", "complaints", "student welfare"]
  },
  "How are research and publications supported at SFGC?": {
    "answer": "SFGC encourages faculty and student research through: Research funding for approved projects, support for conference participation, encouragement for academic publications, access to research journals and databases, collaboration with industry partners for applied research, and dedicated research facilities. The college recognizes research as integral to academic excellence and supports researchers through grants, mentoring, and publication support.",
    "category": "Academics",
    "tags": ["research", "publications", "academic", "papers", "journals", "innovation"]
  },
  "Can I pursue BCA at SFGC?": {
    "answer": "Yes! SFGC offers Bachelor of Computer Applications (BCA) - a 3-year undergraduate program. BCA covers core computer science subjects including programming, data structures, databases, web development, cloud computing, and software engineering. The program emphasizes both theoretical knowledge and practical coding skills. With excellent infrastructure, experienced faculty, and high placement rate, BCA graduates get placed in IT companies, banks, and fintech firms.",
    "category": "Academics",
    "tags": ["BCA", "computer applications", "IT", "programming", "software"]
  },
  "Tell me about different ways to reach SFGC": {
    "answer": "SFGC is easily accessible through multiple modes: By Phone - Call 080-22955369, 080-22955370, 080-22955371 anytime. By Email - Send queries to info@sfgc.ac.in or pgdept@sfgc.ac.in. By Web - Visit www.sfgc.ac.in for online inquiries. By Visit - Come to C.A. Site No. 26, Yelahanka New Town, Bengaluru during 9:30 AM-4:00 PM (Mon-Sat). Public transport is available, and the campus is well-marked and easy to locate.",
    "category": "Contact & Location",
    "tags": ["reach", "contact methods", "ways to connect", "communication channels"]
  },
  "What is the academic calendar at SFGC?": {
    "answer": "SFGC follows an academic calendar aligned with Bengaluru City University and Indian academic standards. The college typically operates on a semester-based system with regular semesters, mid-exams, end-semester exams, and vacation periods. The academic year generally runs from June to May with breaks for summer vacation, exam preparation, and semester transitions. Specific dates are available on the college website and shared with students at the beginning of each academic year.",
    "category": "Academics",
    "tags": ["academic calendar", "semester", "exam schedule", "holidays", "vacation"]
  },
  "What certifications can I prepare for at SFGC?": {
    "answer": "SFGC supports preparation for professional certifications: CA (Chartered Accountant) - accounting and taxation expertise. CS (Company Secretary) - corporate governance and compliance. CMA (Cost Management Accountant) - financial management and analysis. ACCA (Association of Chartered Certified Accountants) - international accounting qualification. SFGC provides coaching, mentoring, study materials, and faculty guidance for all these professional exams. The college has dedicated competitive exam centers and experienced mentors.",
    "category": "Academics",
    "tags": ["certifications", "professional exams", "CA", "CS", "CMA", "ACCA", "competitive"]
  },
  "How is the campus environment at SFGC?": {
    "answer": "SFGC provides a positive and supportive campus environment: Academic Excellence - Focus on quality teaching and learning. Diversity and Inclusion - Students from various backgrounds and states. Safety and Security - 24/7 CCTV, security guards, safe spaces. Community Support - Peer mentoring, faculty guidance, student councils. Vibrant Activities - Sports, cultural events, tech fests, NSS, NCC. Modern Infrastructure - Well-maintained facilities for learning and recreation. Collaborative Atmosphere - Teamwork and cooperation encouraged among students.",
    "category": "College Overview",
    "tags": ["campus environment", "atmosphere", "culture", "community", "student life"]
  },
  "What is the admission timeline for SFGC?": {
    "answer": "SFGC admission timeline: Application Period - Usually January-May each year. Merit List Announcement - Within 2 weeks of application deadline. Admission Completion - June-July before academic year starts. Document Verification - Conducted at the office during admission. Fee Payment - Can be done online or at the office. Orientation - Usually conducted 1-2 weeks before classes start. Regular Admission - Open throughout the year based on vacancy. For exact dates, check www.sfgc.ac.in or call the admissions office.",
    "category": "Admissions",
    "tags": ["admission timeline", "dates", "schedule", "when to apply", "deadlines"]
  },
  "What makes SFGC unique compared to other colleges?": {
    "answer": "SFGC's unique strengths: NAAC A+ Accreditation - Quality certified by national body. 95%+ Placement Rate - Among the highest in the region. Industry Partnerships - Direct connections with Infosys, Accenture, TATA. Modern Infrastructure - 3.5 acres, 272 computers, advanced labs. Holistic Education - Academics, sports, cultural, and personality development. Student-Centric - Focus on individual growth and mentoring. Affordable Excellence - Quality education at competitive fees. Safe Campus - Comprehensive security for all students. Diverse Community - Students from multiple states.",
    "category": "College Overview",
    "tags": ["unique", "special", "advantages", "strengths", "differentiator", "why choose SFGC"]
  },
  "How can I get more information about SFGC?": {
    "answer": "Get SFGC Information: Visit Website - www.sfgc.ac.in for detailed information. Call Office - 080-22955369, 080-22955370, 080-22955371. Email Queries - info@sfgc.ac.in for general, pgdept@sfgc.ac.in for postgraduate. Campus Visit - Visit during office hours to explore facilities. Prospectus - Request printed or digital prospectus from admissions office. Social Media - Follow SFGC on official social media channels. Counseling Session - Schedule a counseling appointment with admissions team. Alumni Feedback - Connect with alumni for firsthand experience.",
    "category": "Contact & Location",
    "tags": ["information", "enquiry", "details", "prospectus", "brochure", "more details"]
  },
  "What is the student support system at SFGC?": {
    "answer": "SFGC provides comprehensive student support: Academic Mentoring - Faculty mentors guide academic progress. Counseling Services - Mental health and personal counseling available. Anti-Ragging Cell - Ensures safe environment, zero tolerance policy. Internal Complaints Committee - Handles grievances and complaints. Hostel Support - 24/7 care for residential students. Health Services - Medical facilities and health camps. Placement Support - Dedicated placement cell assistance. Career Guidance - Counseling for career planning. Financial Aid - Scholarships and fee waivers. Library Support - Research assistance and resources.",
    "category": "Student Support",
    "tags": ["support system", "student welfare", "services", "counseling", "help", "assistance"]
  },
  "What are the sports activities and facilities?": {
    "answer": "SFGC offers diverse sports activities and facilities: Sports Available - Cricket, Football, Badminton, Tennis, Table Tennis, Volleyball, Athletics, Gymnastics, Chess. Facilities - Dedicated sports complex with grounds and courts. Coaching - Trained coaches for different sports. Inter-College Competitions - Participation in tournaments and meets. Annual Sports Meet - College-wide sports event in February. Club Memberships - Free access to sports clubs for all students. Fitness Programs - Gym and fitness activities. Team Building - Sports promote teamwork and leadership.",
    "category": "Facilities",
    "tags": ["sports", "athletics", "facilities", "games", "recreation", "fitness"]
  },
  "Tell me about the teaching methodology at SFGC": {
    "answer": "SFGC uses modern, student-centric teaching methodologies: Classroom Teaching - Interactive lectures with student participation. Practical Learning - Labs, projects, and hands-on activities. Case Studies - Real-world business scenarios. Industry Experts - Guest lectures from professionals. Online Resources - Digital learning materials and resources. Continuous Assessment - Regular quizzes and assignments. Internships - Industry experience through internship programs. Group Discussions - Collaborative learning and peer interaction. Research Projects - Student-led research initiatives. Mentoring - Faculty-guided learning paths.",
    "category": "Academics",
    "tags": ["teaching", "methodology", "learning", "education approach", "pedagogy"]
  }
}
